/*!@file CChessPiece.h
*******************************************************************************
功能:   所有棋子类的声明部分, 包括机器棋子类和人棋子类以及棋子类的共性
作者:   rookie2(rookie2@163.com)
备注:
最近修改时间: 2012年10月21日
修改内容: 对注释的修改
******************************************************************************/

#pragma once

#include "surakarta.h"
#include "CPath.h"

/*!@class CChessPiece
*******************************************************************************
作者: rookie2(rookie2@163.com)
描述: 封装了一颗棋子所必须的基本属性和方法
******************************************************************************/
class CChessPiece
{
protected:
    const int   m_c_nIdx;     // 常量,用于标识所创建的对象
    POSITION    m_pos;       // 存储所在位置
    HWND        m_hPieceWnd; // 存储棋子的窗口句柄
public:
    static bool s_bIsMoving; // 记录当前是否有该类对象处于占用ShowMoving线程
public:
    /*!@function CChessPiece
    ***************************************************************************
    功能: constructor of class CChessPiece
    参数: c_nIdx [in] 该对象的固定索引值,用于唯一标识当前所创建的对象
    **************************************************************************/
    CChessPiece(const int c_nIdx);

    /* destructor of CChessPiece class */
    ~CChessPiece();

    /*!@function GetPieceWnd
    ***************************************************************************
    功能:返回棋子窗口句柄
    **************************************************************************/
    HWND GetPieceWnd();
    
    /*!@function New
    ***************************************************************************
    功能: 创建一个新的机器方棋子
    参数: c_pos [in] 初始化棋子的位置
    **************************************************************************/
    virtual void New (const POSITION c_pos) = 0;
    
    /*!@function Move
    ***************************************************************************
    功能: 在棋盘上显示棋子的移动过程
    参数: c_direct [in] 棋子移动的方向值
    **************************************************************************/
    virtual void Move(const DIRECTION c_direct) = 0;

    /*!@function BeEaten
    ***************************************************************************
    功能: 棋子被吃时调用,用于销毁棋子窗口
    **************************************************************************/
    void BeEaten();
};

/*!@class CMacPiece
*******************************************************************************
作者: rookie2(rookie2@163.com)
描述: 继承至CChesePiece,封装了机器棋子所必须的基本属性和方法
******************************************************************************/
class CMacPiece: public CChessPiece
{
private:
    CMachinePath m_path; // 存储路径
public:
    /*!@function CMacPiece
    ***************************************************************************
    功能: Constructor of CMacPiece
    参数: [in] c_nIdx 该对象的固定索引值,用于唯一标识当前所创建的对象
    **************************************************************************/
    CMacPiece(const int c_nIdx);

    /*!@function New
    ***************************************************************************
    功能: 创建一个新的机器方棋子
    参数: c_pos [in] 初始化棋子的位置
    **************************************************************************/
    void New (const POSITION c_pos);
    
    /*!@function Move
    ***************************************************************************
    功能: 在棋盘上显示棋子的移动过程
    参数: c_direct [in] 棋子移动的方向值
    **************************************************************************/
    void Move(const DIRECTION c_direct);
    
    /*!@function Move
    ***************************************************************************
    功能: 在棋盘上显示棋子的移动过程
    参数: path [in] 棋子移动的路径值
    **************************************************************************/
    void Move(PATH path);
    
    /*!@function Fly
    ***************************************************************************
    功能: 机器棋子用来试探飞行吃子,用于寻找是否有可以吃子的路径,即飞行路径
    **************************************************************************/
    void Fly ();
};

/*!@class CManPiece
*******************************************************************************
作者: rookie2(rookie2@163.com)
描述: 继承至CChessPiece,封装了人的棋子所必须的基本属性和方法
******************************************************************************/
class CManPiece: public CChessPiece
{
private:
    static HWND s_hFlagWnd; // 标记的窗口句柄,用于标记玩家哪颗棋子被选中
public:
    /* 玩家当前被选中棋子的索引值, 即棋子对象初始化时的常量索引值 */
    static int s_nCurBeSelectedPieceIndex;
public:
    /*!@function CManPiece
    ***************************************************************************
    功能: Constructor of CManPiece
    参数: c_nIdx [in] 固定索引,用于唯一标识当前被创建的对象
    **************************************************************************/
    CManPiece(const int c_nIdx);

    /*!@function New
    ***************************************************************************
    功能: 创建一个新的人方棋子
    参数: pos [in] 棋子的初始位置
    **************************************************************************/
    void New (const POSITION c_pos);

    /*!@function Move
    ***************************************************************************
    功能: 在棋盘上显示人方棋子的移动过程
    参数: c_direct [in] 指定移动方向
    **************************************************************************/
    void Move(const DIRECTION c_direct);

    /*!@function BeSelected
    ***************************************************************************
    功能: 当玩家鼠标选中一颗棋子时调用,用于搜索该棋子所能走和吃子的所有路径,以供玩家选择
    **************************************************************************/
    void BeSelected();
};